<template>
  <section class="container max-w-7xl my-0 mx-auto px-3 flex items-center">
    <div class="">
      <InfoAbout title="ماهو غيث">
        <p>
          غيث هو حاضنة إلكترونية تجمع عدة مشاريع رقمية على شكل مجموعة من المواقع التي يكون الغرض منها تطبيق مشاريع وزيادة الإنتاجية الذاتية ، مع تحديد مجال إنشاء هذه المشاريع لتكون مساهمة تماما لأغراض دينية تخدم الإسلام والقرآن والسنة دفاعا أو طلبا للعلم والمطالعة
        </p>
      </InfoAbout>

      <InfoAbout title="لماذا غيث">
        <p>
          إن هوايتي هي البرمجة، وتعلم البرمجة يحتاج إلى وقت وكذلك إلى التطبيق ، ويعني بالتطبيق تنفيذ مشاريع القصد منها تطوير ما قد تعلمته ، ولإنشاء تطبيقات فإنني بحاجة إلى الأفكار لذلك قد اخترت الإسلام ليكون واجهتي في تنفيذ مشاريع مختلفة تخدمه لتكون هناك فائدتين: تطوير نفسي ثم اتجاه سليم لتطبيقاتي
        </p>
      </InfoAbout>

      <InfoAbout title="المحتوى">
        <p>ينقسم المحتوى الى مشاريع اخرى تحت حاضنة غيث، على سبيل المثال</p>
        <p>يتم حاليا العمل على مشروعين اساسيين: <strong>أحمد</strong> و <strong>الفرقان</strong>.</p>
        <InfoAbout title="أحمد">
          <p>هو موسوعة بسيطة لأحاديث الرسول (صلى الله عليه و سلم)</p>
          <p>تتضمن الموسوعة عدة أبواب تقسم الأحاديث حسب الموضوع.</p>
          <p>ومن بينهم:</p>
          <p><strong>باب الأحاديث</strong>: باب لأشهر الأحاديث ومنهم الأربعون نووي.</p>
          <p><strong>باب الأخلاق</strong>: باب يحتوي على أحاديث تتكلم عن الأخلاق الحميدة والذميمة.</p>
          <p><strong>باب الدعاء</strong>: و هو أحاديث الرسول التي تتضمن على دعاء.</p>
          <p><strong>باب السيرة النبوية</strong>: وهو باب يلخص السيرة النبوية.</p>
          <p>أما عن مراحل تطور المشروع:</p>
          <p><strong>الحالة</strong>: تم الانتهاء من الواجهة الأمامية، و تم الإنتهاء من تسهيل عملية إضافة المحتوى.</p>
          <p><strong>المحتوى</strong>: يتم العمل على اضافته.</p>
        </InfoAbout>
      </InfoAbout>
    </div>
  </section>
</template>

<script>
import InfoAbout from '~/components/about/InfoAbout.vue';
export default {
    components: { InfoAbout }
}
</script>